---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.ForwardIterator
source: html/154a2a44-36d5-2958-cc88-884bfa9a2800.htm
---
# Autodesk.Revit.DB.EdgeArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual EdgeArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.